extends Node

var intro = [
	{
		"Name": "",
		"Background": null,
		"Text": "...",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "...",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "...",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Далёкое человеческое будущее, в  каком то из многочисленных секторов бескрайней галактики идёт очередная космическая баталия.",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Я - один из миллиардов боевых пилотов, сражающихся под флагом своей империи...",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Не понятно зачем. Не понятно, за что.",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Но в данный момент меня интересует лишь то, что мы проигрываем.",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Вполне возможно, это мои последние минуты жизни.",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Однако для таких случаев в системе наших кораблей предусмотрена система катапультирования. Стоит только нажать на кнопку и...",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Мою кабину выкинет в бескрайний космос, а я сам погружусь в криосон",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Я должен буду проснуться от криосна сразу после того, как приземлюсь на какую то планету...",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Но кто знает, куда именно я попаду. Может я попаду прямо в руки вражественной империи?",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Или на дикую планету, куда не ступала нога разумного существа?",
		"choise": ""
	},
	{
		"Name": "",
		"Background": null,
		"Text": "Не время думать об этом... Больше вариантов у меня нет.",
		"choise": "Катапультироваться."
	},
]

var after_catapult = []
